시작하기 전에 필요한 라이브러리와 가공되지 않은 형태의 타이타닉 자료를 불러옵시다

In [1]:
import seaborn as sns
import pandas as pd
titanic = sns.load_dataset('raw/titanic') # 앞서 사용한 내장 데이터셋 사용 방법
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

## Q 3-1

야생의 타이타닉 데이터셋에서 **모든 결측치의 총 개수**를 `total_na` 변수에 저장해보세요!

In [2]:
titanic.isnull()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
887,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,True,False,False,False,False,False,False,False,True,False,False,False
889,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False

In [4]:
# prob 1
total_na = titanic.isnull().sum().sum()
# 결과보기
total_na

869

총 866개가 나온다면 정답입니다.

## Q 3-2

수업시간에는 야생의 타이타닉 데이터셋에서 관측되지 않은(`NA`) 나이 항목을 채워주었습니다.  
이번에는 **나이**가 관측되지 않은 사람들의 관측치 **행(row)를 모두 제거**해 타이타닉 데이터셋을 **업데이트(`inplcae=True`)**해주세요!

> 힌트: `dropna()`함수의 `subset` 인자는 `NA` 값을 탐색할 열을 지정합니다.

In [5]:
# sol 2
titanic.dropna(inplace=True)
# 결과보기
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
871,1,1,female,47.0,1,1,52.5542,S,First,woman,False,D,Southampton,yes,False
872,0,1,male,33.0,0,0,5.0000,S,First,man,True,B,Southampton,no,True
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

> <img src = "https://1.bp.blogspot.com/-e1MwoXVimZc/XrTMAP9ihmI/AAAAAAAAAVA/d96vQpzsEK4zUHUfm3s3Z3HzN5x7M35BQCLcBGAsYHQ/s1600/%25E1%2584%2589%25E1%2585%25B3%25E1%2584%258F%25E1%2585%25B3%25E1%2584%2585%25E1%2585%25B5%25E1%2586%25AB%25E1%2584%2589%25E1%2585%25A3%25E1%2586%25BA%2B2020-05-08%2B%25E1%2584%258B%25E1%2585%25A9%25E1%2584%258C%25E1%2585%25A5%25E1%2586%25AB%2B11.56.06.png">
> 이런 결과가 나오도록 해주세요! 총 714개의 행이 남아있으면 됩니다.

## Q 3-3

타이타닉 데이터셋에 나이가 **30세 미만인 사람은 0**을, **30세 이상, 50세 미만인 사람은 1**을, **50세 이상인 사람은 2**의 값을 갖는 **열 `age_ind`를 추가**해보세요.

이때, `age_ind`는 **정수형(int) 값**을 가져야합니다.

> <img src = "https://1.bp.blogspot.com/-fxN7Jm4zE9E/XrTL_RK1mdI/AAAAAAAAAU8/avMSlOgjzbI-iA1Vn9qW3uk8LlsOvIZ-wCLcBGAsYHQ/s1600/%25E1%2584%2589%25E1%2585%25B3%25E1%2584%258F%25E1%2585%25B3%25E1%2584%2585%25E1%2585%25B5%25E1%2586%25AB%25E1%2584%2589%25E1%2585%25A3%25E1%2586%25BA%2B2020-05-08%2B%25E1%2584%258B%25E1%2585%25A9%25E1%2584%2592%25E1%2585%25AE%2B12.01.39.png">
> 이런 결과가 나오면 됩니다.

In [ ]:
# sol 3
titanic['age_ind'] = titanic['age']
titanic.loc[titanic['age_ind'] < 30, 'age_ind'] = 0
titanic.loc[(titanic['age_ind'] >= 30) & (titanic['age_ind'] <= 50), 'age_ind'] = 1
titanic.loc[titanic['age_ind'] > 50, 'age_ind'] = 2
titanic['age_ind'] = titanic['age_ind'].astype(int)

# 결과보기
titanic.head()

## Q 3-4

마지막으로 각 **`age_ind`**에 대해 **`pclass`의 분포**를 **막대그래프의 형태로 시각화**해주세요,

> 이렇게요!  
> <img src = "https://1.bp.blogspot.com/-q4z7gH25cqU/XrTIUKo-7LI/AAAAAAAAAUs/CIK6bIIRRqUhxzWSlpzYMMSIgbqLoPKXQCLcBGAsYHQ/s1600/%25E1%2584%2589%25E1%2585%25B3%25E1%2584%258F%25E1%2585%25B3%25E1%2584%2585%25E1%2585%25B5%25E1%2586%25AB%25E1%2584%2589%25E1%2585%25A3%25E1%2586%25BA%2B2020-05-08%2B%25E1%2584%258B%25E1%2585%25A9%25E1%2584%258C%25E1%2585%25A5%25E1%2586%25AB%2B11.47.30.png" width = "400">

In [ ]:
# sol 4
sns.countplot(data=titanic, x='pclass', hue='age_ind');

승객별로 나이의 분포가 비슷한가요? 다른가요?